#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-web-pe][0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-web-pe][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_resource_group.management_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-mgmt-rg][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg][0m
[0m[1mazurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg][0m
[0m[1mazurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mazurerm_subnet.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet.devops_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_exp_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_exp_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.devops_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet_route_table_association.devops_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_aut_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_aut_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001][0m
[0m[1mmodule.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001][0m
[0m[1mmodule.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mazurerm_subnet_network_security_group_association.powerbi_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.powerbi_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.storage_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.storage_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.runtimes_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_route_table_association.runtimes_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-portal-pe][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-datafactory-pe][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-kv001-pe][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/4f7f3239-4665-40f0-608f-38149c36ef6a][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/bc5d6cf5-8be9-31f2-cf95-d5e0e3a62d9f][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-kv001-pe][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/7676dddf-ebc9-97f9-5d42-b1bb838c0b00][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1ed03e24-4a7f-e600-c1b7-2bd3cec0e000][0m
[0m[1mmodule.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/backendAddressPools/mydlz01-dev-shir001-backendaddresspool][0m
[0m[1mmodule.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/inboundNatPools/mydlz01-dev-shir001-natpool][0m
[0m[1mmodule.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/probes/mydlz01-dev-shir001-probe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-queue-pe][0m
[0m[1mmodule.datalake_workspace.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/data][0m
[0m[1mmodule.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-blob-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/managementPolicies/default][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-table-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/managementPolicies/default][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-dfs-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-blob-pe][0m
[0m[1mmodule.datalake_enriched.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-dfs-pe][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-blob-pe][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Read complete after 2s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/managementPolicies/default][0m
[0m[1mmodule.datalake_curated.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-dfs-pe][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-blob-pe][0m
[0m[1mmodule.datalake_raw.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default/containers/data][0m
[0m[1mmodule.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/loadBalancingRules/mydlz01-dev-shir001-rule][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001/integrationruntimes/mydlz01-dev-shir001][0m
[0m[1mmodule.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=4175911308037159|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E963F6819300179D][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E963F6819300179E][0m
[0m[1mmodule.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz01-dev-shir001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz01-dev-aut-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydlz01-dev-aut-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz01-dev-shared-app-aut-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydlz01-dev-aut-dbw001-uiapi-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz01-dev-aut-dbw001-uiapi-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_web[0m will be [1m[31mdestroyed[0m
  # (because azurerm_private_endpoint.databricks_private_endpoint_web is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      [31m-[0m[0m custom_dns_configs            = [] [90m-> null[0m[0m
      [31m-[0m[0m custom_network_interface_name = "mydlz01-dev-aut-dbw001-web-nic" [90m-> null[0m[0m
      [31m-[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-web-pe" [90m-> null[0m[0m
      [31m-[0m[0m location                      = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name                          = "mydlz01-dev-aut-dbw001-web-pe" [90m-> null[0m[0m
      [31m-[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/networkInterfaces/mydlz01-dev-aut-dbw001-web-nic"
              [31m-[0m[0m name = "mydlz01-dev-aut-dbw001-web-nic"
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-web-pe/privateDnsZoneGroups/mydlz01-dev-aut-dbw001-web-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.32.71",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.32.72",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name           = "mydlz01-dev-shared-app-aut-rg" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet" [90m-> null[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m

      [31m-[0m[0m private_dns_zone_group {
          [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-web-pe/privateDnsZoneGroups/mydlz01-dev-aut-dbw001-web-arecord" [90m-> null[0m[0m
          [31m-[0m[0m name                 = "mydlz01-dev-aut-dbw001-web-arecord" [90m-> null[0m[0m
          [31m-[0m[0m private_dns_zone_ids = [
              [31m-[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ] [90m-> null[0m[0m
        }

      [31m-[0m[0m private_service_connection {
          [31m-[0m[0m is_manual_connection           = false [90m-> null[0m[0m
          [31m-[0m[0m name                           = "mydlz01-dev-aut-dbw001-web-pe" [90m-> null[0m[0m
          [31m-[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001" [90m-> null[0m[0m
          [31m-[0m[0m private_ip_address             = "10.0.32.71" [90m-> null[0m[0m
          [31m-[0m[0m subresource_names              = [
              [31m-[0m[0m "browser_authentication",
            ] [90m-> null[0m[0m
        }
    }

[1m  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_ui" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydlz01-dev-exp-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydlz01-dev-exp-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydlz01-dev-shared-app-exp-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydlz01-dev-exp-dbw001-uiapi-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydlz01-dev-exp-dbw001-uiapi-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_web[0m will be [1m[31mdestroyed[0m
  # (because azurerm_private_endpoint.databricks_private_endpoint_web is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_private_endpoint" "databricks_private_endpoint_web" {
      [31m-[0m[0m custom_dns_configs            = [] [90m-> null[0m[0m
      [31m-[0m[0m custom_network_interface_name = "mydlz01-dev-exp-dbw001-web-nic" [90m-> null[0m[0m
      [31m-[0m[0m id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-web-pe" [90m-> null[0m[0m
      [31m-[0m[0m location                      = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name                          = "mydlz01-dev-exp-dbw001-web-pe" [90m-> null[0m[0m
      [31m-[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/networkInterfaces/mydlz01-dev-exp-dbw001-web-nic"
              [31m-[0m[0m name = "mydlz01-dev-exp-dbw001-web-nic"
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-web-pe/privateDnsZoneGroups/mydlz01-dev-exp-dbw001-web-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.32.86",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.0.32.87",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name           = "mydlz01-dev-shared-app-exp-rg" [90m-> null[0m[0m
      [31m-[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet" [90m-> null[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m

      [31m-[0m[0m private_dns_zone_group {
          [31m-[0m[0m id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-web-pe/privateDnsZoneGroups/mydlz01-dev-exp-dbw001-web-arecord" [90m-> null[0m[0m
          [31m-[0m[0m name                 = "mydlz01-dev-exp-dbw001-web-arecord" [90m-> null[0m[0m
          [31m-[0m[0m private_dns_zone_ids = [
              [31m-[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ] [90m-> null[0m[0m
        }

      [31m-[0m[0m private_service_connection {
          [31m-[0m[0m is_manual_connection           = false [90m-> null[0m[0m
          [31m-[0m[0m name                           = "mydlz01-dev-exp-dbw001-web-pe" [90m-> null[0m[0m
          [31m-[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001" [90m-> null[0m[0m
          [31m-[0m[0m private_ip_address             = "10.0.32.86" [90m-> null[0m[0m
          [31m-[0m[0m subresource_names              = [
              [31m-[0m[0m "browser_authentication",
            ] [90m-> null[0m[0m
        }
    }

[1m  # module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose[0m will be created
[0m  [32m+[0m[0m resource "databricks_cluster_policy" "cluster_policy_all_purpose" {
      [32m+[0m[0m definition = jsonencode(
            {
              [32m+[0m[0m "autoscale.max_workers"               = {
                  [32m+[0m[0m defaultValue = 5
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "autoscale.min_workers"               = {
                  [32m+[0m[0m defaultValue = 1
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m autotermination_minutes               = {
                  [32m+[0m[0m defaultValue = 30
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 120
                  [32m+[0m[0m minValue     = 1
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "azure_attributes.availability"       = {
                  [32m+[0m[0m defaultValue = "ON_DEMAND_AZURE"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "fixed"
                }
              [32m+[0m[0m "azure_attributes.spot_bid_max_price" = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = -1
                }
              [32m+[0m[0m "cluster_log_conf.path"               = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "dbfs:/cluster-logs"
                }
              [32m+[0m[0m "cluster_log_conf.type"               = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "DBFS"
                }
              [32m+[0m[0m cluster_type                          = {
                  [32m+[0m[0m type  = "fixed"
                  [32m+[0m[0m value = "all-purpose"
                }
              [32m+[0m[0m "custom_tags.costCenter"              = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m pattern    = "[A-Z]{5}-[0-9]{5}"
                  [32m+[0m[0m type       = "regex"
                }
              [32m+[0m[0m data_security_mode                    = {
                  [32m+[0m[0m defaultValue = "SINGLE_USER"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m type         = "allowlist"
                  [32m+[0m[0m values       = [
                      [32m+[0m[0m "SINGLE_USER",
                      [32m+[0m[0m "NONE",
                    ]
                }
              [32m+[0m[0m dbus_per_hour                         = {
                  [32m+[0m[0m maxValue = 100
                  [32m+[0m[0m type     = "range"
                }
              [32m+[0m[0m driver_instance_pool_id               = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m enable_local_disk_encryption          = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = true
                }
              [32m+[0m[0m instance_pool_id                      = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m num_workers                           = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m spark_version                         = {
                  [32m+[0m[0m defaultValue = "auto:latest-lts"
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "unlimited"
                }
              [32m+[0m[0m "ssh_public_keys.*"                   = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
            }
        )
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m name       = "cluster-policy-all-purpose"
      [32m+[0m[0m policy_id  = (known after apply)
    }

[1m  # module.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job[0m will be created
[0m  [32m+[0m[0m resource "databricks_cluster_policy" "cluster_policy_job" {
      [32m+[0m[0m definition = jsonencode(
            {
              [32m+[0m[0m "autoscale.max_workers"                       = {
                  [32m+[0m[0m defaultValue = 5
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "autoscale.min_workers"                       = {
                  [32m+[0m[0m defaultValue = 1
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m maxValue     = 10
                  [32m+[0m[0m type         = "range"
                }
              [32m+[0m[0m "azure_attributes.availability"               = {
                  [32m+[0m[0m defaultValue = "ON_DEMAND_AZURE"
                  [32m+[0m[0m hidden       = true
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "fixed"
                }
              [32m+[0m[0m "azure_attributes.spot_bid_max_price"         = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = -1
                }
              [32m+[0m[0m "cluster_log_conf.path"                       = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "dbfs:/cluster-logs"
                }
              [32m+[0m[0m "cluster_log_conf.type"                       = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = "DBFS"
                }
              [32m+[0m[0m cluster_type                                  = {
                  [32m+[0m[0m type  = "fixed"
                  [32m+[0m[0m value = "job"
                }
              [32m+[0m[0m "custom_tags.costCenter"                      = {
                  [32m+[0m[0m hidden     = false
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m pattern    = "[A-Z]{5}-[0-9]{5}"
                  [32m+[0m[0m type       = "regex"
                }
              [32m+[0m[0m enable_local_disk_encryption                  = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = false
                  [32m+[0m[0m type       = "fixed"
                  [32m+[0m[0m value      = true
                }
              [32m+[0m[0m num_workers                                   = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m "spark_conf.spark.databricks.cluster.profile" = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
              [32m+[0m[0m spark_version                                 = {
                  [32m+[0m[0m defaultValue = "auto:latest-lts"
                  [32m+[0m[0m hidden       = false
                  [32m+[0m[0m isOptional   = false
                  [32m+[0m[0m type         = "unlimited"
                }
              [32m+[0m[0m "ssh_public_keys.*"                           = {
                  [32m+[0m[0m hidden     = true
                  [32m+[0m[0m isOptional = true
                  [32m+[0m[0m type       = "forbidden"
                }
            }
        )
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m name       = "cluster-policy-job"
      [32m+[0m[0m policy_id  = (known after apply)
    }

[1m  # module.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "perfectthymetech-northeurope"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"
      [32m+[0m[0m workspace_id         = 2769391400051353
    }

[1m  # module.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope[0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_scope" "platform_secret_scope" {
      [32m+[0m[0m backend_type = "AZURE_KEYVAULT"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "platform-secret-scope"

      [32m+[0m[0m keyvault_metadata {
          [32m+[0m[0m dns_name    = "https://mydlz01-dev-exp-kv001.vault.azure.net/"
          [32m+[0m[0m resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001"
        }
    }

[1mPlan:[0m 6 to add, 0 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>